package com.hard;

public class Main {
    public static void main(String[] args) {
        /**
         * private:
         * используется в
         * внутренних классах, конструкторах, полях и методах класса
         * Доступ разрешен только в текущем классе.
         *
         * default (package-private):
         * используется в
         * классах и интерфейсах, внутренних классах, конструкторах, полях и методах класса
         * Доступ на уровне пакета.
         *
         * protected:
         * используется в
         * внутренних классах, конструкторах, полях и методах класса
         * Модификатор доступа на уровне пакета и в иерархии наследования.
         *
         * public:
         * используется в
         * классах и интерфейсах, внутренних классах, конструкторах, полях и методах класса
         * Модификатор доступа общественный, доступен всем.
         *
         * Последовательность модификаторов по убыванию уровня закрытости: private, default ,protected, public).
         */
    }
}
